Repository: TechupBusiness/ost-loyalty-cscart
Catalog: var/langs/*/addons/ost_loyalty.po
Languages: de_de

# Addons::description::ost_loyalty
source: Integrates your custom branded cryptocurrency based on SimpleToken (OST) into CS-Cart, to create your own community and reward users.
de_de: Integriert eine eigene Crypto-Währung als Kundenbindungsprogramm (Punkte-Konto für Kunden) auf Basis von SimpleToken (OST) in CS-Cart.

# SettingsSections::ost_loyalty::general
source: General
de_de: Allgemein

# SettingsTooltips::ost_loyalty::api_key
source: Please insert your API Key here, from your OST Kit Backend.
de_de: Bitte fügen Sie hier ihren API Key ein, den Sie in Ihrem OST Kit Administrationsbereich finden.

# SettingsTooltips::ost_loyalty::api_secret
source: Please insert your API Secret here, from your OST Kit Backend.
de_de: Bitte fügen Sie hier ihr API Secret ein, das Sie in Ihrem OST Kit Administrationsbereich finden.

# SettingsOptions::ost_loyalty::company_uuid
source: Company UUID
de_de: Unternehmens-UUID

# SettingsTooltips::ost_loyalty::company_uuid
source: Please insert your company UUID, from your OST Kit Backend. You will find it in the 'Developers' section and it looks like '5819b92d-2678-43d1-6c31-a567a3b50s73'.
de_de: Bitte fügen Sie hier ihre Unternehmens-UUID ein. Sie finden Sie im 'Developer' Bereich in Ihrem Kit Administrationsbereich. Die UUID sieht beispielsweise so aus: '5819b92d-2678-43d1-6c31-a567a3b50s73'

# SettingsOptions::ost_loyalty::mode
source: Mode
de_de: Modus

# SettingsTooltips::ost_loyalty::mode
source: You can use the mode option to control whether to use the live environment or the test environement.
de_de: Sie können diese Option verwenden um zu kontrollieren, ob die Live- oder Testumgebung verwendet werden soll.

# SettingsOptions::ost_loyalty::user_privacy
source: User privacy
de_de: Privatsphären-Einstellung

# SettingsTooltips::ost_loyalty::user_privacy
source: You can decide if you want to publish your users email address to the OST blockchain (as username) or not. Better set this to private.
de_de: Hier können Sie festlegen, ob die E-Mail addresse der Benutzer in der OST blockchain (als Benutzername) verwendet werden soll. Wir empfehlen dies auf 'Privat' zu stellen.

# SettingsVariants::ost_loyalty::user_privacy::private
source: Private
de_de: Privat

# SettingsVariants::ost_loyalty::user_privacy::public
source: Public
de_de: Öffentlich

# SettingsOptions::ost_loyalty::enabled_transactions
source: Enabled transaction types
de_de: Aktivierte Transaktions-Typen

# Languages::addonTransactionType.userRegistration
source: User registration
de_de: Benutzer-Registrierung

# SettingsOptions::ost_loyalty::transactionType_userRegistration
source: User registration
de_de: Benutzer-Registrierung

# SettingsOptions::ost_loyalty::transactionType_userRegistration_CurrencyType
source: Value type
de_de: Wert-Typ

# SettingsTooltips::ost_loyalty::transactionType_userRegistration_CurrencyType
source: TODO Description for currencyType.
de_de: TODO Beschreibung für currencyType.

source: Fixed
de_de: Festgelegt

source: Floating
de_de: Flexibel

# SettingsOptions::ost_loyalty::transactionType_userRegistration_CurrencyValue
source: Value (in chosen currency)
de_de: Wert (in gewählter Währung)
